
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) 
		Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период начисления");
		Возврат;
	КонецЕсли;
			
	Объект.ОсновныеНачисления.Очистить();

	IDЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени("ЗаполнениеДокументаНачислениеЗаПервуюПоловинуМесяца",,Ложь);
	
	ЗаполнитьОкладНаСервере(); 
		
	ЗаполнитьПроцентОтРаботНаСервере(); 
			
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(IDЗамера);
	
	IDЗамера = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОкладНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	Пользователи.Представление КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО (ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = Пользователи.Ссылка)
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.Недействителен = ЛОЖЬ
	|	И Пользователи.Служебный = ЛОЖЬ
	|	И Пользователи.Наименование <> ""Администратор""";
	
	Запрос.УстановитьПараметр("Дата", Объект.ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Сотрудник = Null	Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для сотрудника %1 не установлен оклад",
			Выборка.Пользователь));
			Объект.ОсновныеНачисления.Очистить();
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = Объект.ОсновныеНачисления.Добавить();
		НоваяСтрока.Сотрудник     = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета    = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		НоваяСтрока.Показатель    = Выборка.Оклад;
		НоваяСтрока.ДатаНачала    = Объект.ДатаНачала;
		НоваяСтрока.ДатаОкончания = Объект.ДатаОкончания;
		НоваяСтрока.ГрафикРаботы  = Выборка.ГрафикРаботы; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентОтРаботНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот) КАК СуммаКОплатеОборот
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц,) КАК
	|		ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ОсновныеНачисления.Добавить();
		НоваяСтрока.Сотрудник     = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета    = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтРабот;
		НоваяСтрока.Показатель    = Выборка.СуммаКОплатеОборот;
		НоваяСтрока.ДатаНачала    = Объект.ДатаНачала;
		НоваяСтрока.ДатаОкончания = Объект.ДатаОкончания;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
